In [ ]:
1.series
2.dataframes
pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\rohith\anaconda3.1\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\rohith\anaconda3.1\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\rohith\anaconda3.1\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\rohith\anaconda3.1\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\rohith\anaconda3.1\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [4]:
import pandas as pd

In [5]:
print(pd.__version__)

1.5.3

# SERIES

In [10]:
list=[1,2,3,4,5]
label=['a','b','c','d','e']

In [11]:
list

[1, 2, 3, 4, 5]

In [14]:
type(list)

list

In [13]:
ser=pd.Series(list,index=label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
difference b/w series and numpy array
in series index can vary 
>500k performance of pandas is better
<numpy array are used

In [16]:
marks={"maths":50,"science":80,"Physics":48,"chemistry":95}
Ser=pd.Series(marks)

In [18]:
Ser

maths        50
science      80
Physics      48
chemistry    95
dtype: int64

In [24]:
Ser=pd.Series(marks,index=["maths","science","Physics"])

In [25]:
Ser

maths      50
science    80
Physics    48
dtype: int64

In [27]:
Ser[1]

80

## series indexing

In [29]:
Ser["science"]

80

## Slicing

In [30]:
Ser[1:3]

science    80
Physics    48
dtype: int64

In [31]:
Ser[1:]

science    80
Physics    48
dtype: int64

In [35]:
Ser[2:]

Physics    48
dtype: int64

In [36]:
Ser.shape

(3,)

In [37]:
type(Ser)

pandas.core.series.Series

# Data Frames

In [ ]:
A DataFrame isÂ a data structure that organizes data into a 
2-dimensional table of rows and columns, much like a spreadsheet

In [40]:
list=[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]

columns=["a","b","c","d"]
labels=["A","B","C","D"]
df=pd.DataFrame(list,index=labels,columns=columns)

In [41]:
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [44]:
df=pd.DataFrame({"Name":["rohith","jamu","sujatha","pothalaiah"],"Age":[19,18,30,43],"Profession":["UG","UG","HOUSEWIFE","SEO"]})

In [45]:
df

         Name  Age Profession
0      rohith   19         UG
1        jamu   18         UG
2     sujatha   30  HOUSEWIFE
3  pothalaiah   43        SEO

In [46]:
type(df)

pandas.core.frame.DataFrame

In [47]:
df.shape

(4, 3)

In [48]:
df.columns

Index(['Name', 'Age', 'Profession'], dtype='object')

In [55]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [56]:
df1=df.rename(columns={"Name":"First_name"})

In [57]:
df1

   First_name  Age Profession
0      rohith   19         UG
1        jamu   18         UG
2     sujatha   30  HOUSEWIFE
3  pothalaiah   43        SEO

In [58]:
df

         Name  Age Profession
0      rohith   19         UG
1        jamu   18         UG
2     sujatha   30  HOUSEWIFE
3  pothalaiah   43        SEO

In [60]:
df.columns[[0,1]]

Index(['Name', 'Age'], dtype='object')

In [62]:
df.columns.values

array(['Name', 'Age', 'Profession'], dtype=object)

In [64]:
df.columns.values[2]="work"

In [65]:
df

         Name  Age       work
0      rohith   19         UG
1        jamu   18         UG
2     sujatha   30  HOUSEWIFE
3  pothalaiah   43        SEO

### loc

In [ ]:
To retrive the specific row like 2

In [72]:
df.loc[[2,1]]

   Age  work
2   30   NaN
1   18   NaN

In [73]:
df

   Age  work
0   19   NaN
1   18   NaN
2   30   NaN
3   43   NaN

### removing elements

In [83]:
df=pd.DataFrame({"Name":["rohith","jamu","sujatha","pothalaiah"],"Age":[19,18,30,43],"Profession":["UG","UG","HOUSEWIFE","SEO"]})

In [84]:
df.drop("Age",axis=1,inplace=True)

In [85]:
df

         Name Profession
0      rohith         UG
1        jamu         UG
2     sujatha  HOUSEWIFE
3  pothalaiah        SEO

In [86]:
df["place"]=["Vijayawada","gooty","ATP","ATP"]

In [87]:
df

         Name Profession       place
0      rohith         UG  Vijayawada
1        jamu         UG       gooty
2     sujatha  HOUSEWIFE         ATP
3  pothalaiah        SEO         ATP

In [88]:
df=pd.DataFrame({"Name":["rohith","jamu","sujatha","pothalaiah"],"Age":[19,18,30,43],"Profession":["UG","UG","HOUSEWIFE","SEO"]})

In [90]:
df1=pd.DataFrame({"Name":["a","b","c","d"],"Age":[19,18,30,43],"Profession":["UG","UG","HOUSEWIFE","SEO"],"place":["hyd","vellore","chennai","ap"]})

In [91]:
df

         Name  Age Profession
0      rohith   19         UG
1        jamu   18         UG
2     sujatha   30  HOUSEWIFE
3  pothalaiah   43        SEO

In [92]:
df1

  Name  Age Profession    place
0    a   19         UG      hyd
1    b   18         UG  vellore
2    c   30  HOUSEWIFE  chennai
3    d   43        SEO       ap

In [99]:
df3=pd.concat([df,df1],ignore_index="True")

In [100]:
df3

         Name  Age Profession    place
0      rohith   19         UG      NaN
1        jamu   18         UG      NaN
2     sujatha   30  HOUSEWIFE      NaN
3  pothalaiah   43        SEO      NaN
4           a   19         UG      hyd
5           b   18         UG  vellore
6           c   30  HOUSEWIFE  chennai
7           d   43        SEO       ap

## Handle Missing values

In [ ]:
1. Delete the row column
2. imputing the values

In [ ]:
10000   50 records null values------------------------delete row
        5000 records null -----------------------------imputing
        70-80 percent is null in particular column----delete column

In [101]:
df3

         Name  Age Profession    place
0      rohith   19         UG      NaN
1        jamu   18         UG      NaN
2     sujatha   30  HOUSEWIFE      NaN
3  pothalaiah   43        SEO      NaN
4           a   19         UG      hyd
5           b   18         UG  vellore
6           c   30  HOUSEWIFE  chennai
7           d   43        SEO       ap

In [103]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [104]:
df1.isnull()

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [105]:
df1.isnull().any()

Name      True
score1    True
score2    True
dtype: bool

In [106]:
df1.isnull().sum()

Name      2
score1    2
score2    2
dtype: int64

#### Deleting rows containg null values

In [108]:
df1.dropna(inplace=True)

In [109]:
df1

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [110]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [111]:
#delete columns
df1.dropna(axis=1,inplace=True)

In [112]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [113]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [114]:
df1["score1"].mean()

4.5

In [116]:
df1["score1"]=df1["score1"].fillna(df1["score1"].mean())
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [118]:
df1["score2"].median()

5.0

In [117]:
df1["score2"]=df1["score2"].fillna(df1["score2"].median())
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [122]:
df1["Name"].mode()

0    saanvi
Name: Name, dtype: object

In [129]:
df1["Name"]=df1["Name"].fillna(df1["Name"].mode()[0])

In [130]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [131]:
df1.Name.value_counts()

saanvi     4
tulasi     1
supriya    1
Name: Name, dtype: int64

In [132]:
df1.score1.value_counts()

5.0    2
4.0    2
4.5    2
Name: score1, dtype: int64

In [133]:
group=df1.groupby("Name")

In [134]:
group

In [135]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

In [138]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [137]:
df1.shape

(6, 3)

### head and tail

In [139]:
df1.head(2)

     Name  score1  score2
0  tulasi     5.0     5.0
1  saanvi     4.0     5.0

In [140]:
df1.tail(3)

     Name  score1  score2
3  saanvi     4.5     5.0
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

## Slicing Accesing rows and col

### loc,iloc

In [141]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [144]:
df1.loc[[1]]

     Name  score1  score2
1  saanvi     4.0     5.0

In [146]:
df1.loc[[3,5]]

     Name  score1  score2
3  saanvi     4.5     5.0
5  saanvi     5.0     5.0

In [147]:
df1.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0